<?php
// Heading
$_['heading_title']   = 'Обновление';
$_['heading_success'] = 'Обновление - завершено!';

// Text
$_['text_upgrade']    = 'Подготовка к обновлению';
$_['text_server']     = 'Убедитесь, что Ваш сервер настроен правильно';
$_['text_steps']      = 'Прогресс обновления';
$_['text_error']      = 'Опубликуйте сообщения о любых проблемах с ошибками сценария обновления на форумах.';
$_['text_clear']      = 'После обновления удалите все файлы cookie в своем браузере, чтобы избежать ошибок токена.';
$_['text_admin']      = 'Загрузите страницу администратора и дважды нажмите Ctrl+F5, чтобы браузер обновил изменения стилей.';
$_['text_user']       = 'Перейдите в Админ -> Пользователи -> Группы пользователей и измените группу Главного Администратора. Установите все флажки.';
$_['text_setting']    = 'Перейдите в Админ и Измените основные Системные Настройки. Обновите все поля и нажмите "Сохранить", даже если ничего не менялось.';
$_['text_store']      = 'Загрузите витрину магазина и дважды нажмите Ctrl+F5, чтобы браузер обновил изменения стилей.';
$_['text_progress']   = 'Патч %s был применен (%s из %s)';
$_['text_success']    = 'Поздравляю! Вы успешно обновили OpenCart!';

// Entry
$_['entry_progress']  = 'Прогресс';