<?php
// Heading
$_['heading_title']          = 'Конфигурация';

// Text
$_['text_step_3']            = 'Введите сведения о базе данных и администрировании';
$_['text_db_connection']     = '1. Пожалуйста, введите данные для подключения к базе данных.';
$_['text_db_administration'] = '2. Пожалуйста, введите логин и пароль для администрирования.';
$_['text_mysqli']            = 'MySQLi';
$_['text_pdo']               = 'mPDO';
$_['text_pgsql']             = 'PostgreSQL';
$_['text_help']              = 'Информация о настройке баз данных на разных платформах:';
$_['text_cpanel']            = 'Настройка БД в CPanel';
$_['text_plesk']             = 'Настройка БД в Plesk';

// Entry
$_['entry_db_driver']        = 'Драйвер БД';
$_['entry_db_hostname']      = 'Имя хоста';
$_['entry_db_username']      = 'Имя пользователя';
$_['entry_db_password']      = 'Пароль';
$_['entry_db_database']      = 'База данных';
$_['entry_db_port']          = 'Порт';
$_['entry_db_prefix']        = 'Префикс';
$_['entry_username']         = 'Имя пользователя';
$_['entry_password']         = 'Пароль';
$_['entry_email']            = 'Эл. почта';

// Error
$_['error_db_driver']        = 'Требуется драйвер базы данных!';
$_['error_db_hostname']      = 'Имя хоста обязательно!';
$_['error_db_username']      = 'Имя пользователя обязательно!';
$_['error_db_database']      = 'Имя базы данных обязательно!';
$_['error_db_port']          = 'Порт базы данных обязателен!';
$_['error_db_prefix']        = 'Префикс БД может содержать только строчные буквы в диапазоне a-z, 0-9 и подчеркивания.';
$_['error_db_connect']       = 'Ошибка: Не удалось подключиться к базе данных, убедитесь, что сервер базы данных, имя пользователя и пароль верны!';
$_['error_username']         = 'Имя пользователя обязательно!';
$_['error_password']         = 'Пароль обязателен!';
$_['error_email']            = 'Адрес электронной почты недействителен!';
$_['error_config']           = 'Ошибка: Не удалось записать в config.php, убедитесь, что Вы установили правильные разрешения для: ';
